// 用户具有的页面的权限id 英文
export default {
  pageRole: {
    1001: '总览',
    1002: '运维中心',
    1004: '企业管理',
    1006: '报表管理',
    1007: '电站管理',
    1009: '个人任务',
    1010: '大数据可视化',
    1012: '单站视图',
    1015: '区域管理',
    1016: '角色管理',
    1017: '账号管理',
    1018: '数据补采',
    1019: 'KPI修正',
    1020: 'KPI重计算',
    1021: '点表管理',
    1022: '告警设置',
    1023: '电站参数',
    1024: '设备管理',
    1025: '设备通信',
    1026: '系统参数配置',
    1027: 'License管理',
    1028: '组织架构',
    1029: '智慧应用',
    1030: '合作伙伴',
    1031: '设备绑定',
    2001: '电站管理',
    2002: '设备监控',
    2003: '报表管理',
    2004: '任务中心'
  }
}
