
export default {
  devCom: {
    chooseDev: '选择设备',
    reqDev: '设备必选',
    timePoint: '选择对比时间点',
    req: '必填',
    sigPointName: '信号点名称',
    chooseSigPoint: '请选择信号点',
    infInc: '查询信息不完整',
    devComparison: '设备对比',
    listMode: '列表模式',
    graMode: '图形模式',
    // 静态数据表格数据第一列的数据
    staticNameList: ['厂家名称', '组件所属厂家', '组件投产日期', '组件类型', '标称组件转换效率(%)', '峰值功率温度系数(%)',
      '组串1容量(kW)', '组串2容量(kW)', '组串3容量(kW)', '组串4容量(kW)', '组串5容量(kW)', '组串6容量(kW)', '组串7容量(kW)', '组串8容量(kW)', '组串9容量(kW)',
      '组串10容量(kW)', '组串11容量(kW)', '组串12容量(kW)', '组串13容量(kW)', '组串14容量(kW)', '组串15容量(kW)', '组串16容量(kW)', '组串17容量(kW)', '组串18容量(kW)',
      '组串19容量(kW)', '组串20容量(kW)'],
    // 显示运行数据的第一列
    runDataNameList: ['发电量(kWh)', '输出功率(kW)', '组串1电压/电流', '组串2电压/电流', '组串3电压/电流', '组串4电压/电流', '组串5电压/电流',
      '组串6电压/电流', '组串7电压/电流', '组串8电压/电流', '组串9电压/电流', '组串10电压/电流', '组串11电压/电流', '组串12电压/电流',
      '组串13电压/电流', '组串14电压/电流', '组串15电压/电流', '组串16电压/电流', '组串17电压/电流', '组串18电压/电流', '组串19电压/电流',
      '组串20电压/电流'],
    // 组件类型0-9 分别依次对应1-10值得对应值
    componentType: ['多晶', '单晶', 'N型单晶', 'PERC单晶(单晶PERC)', '单晶双玻', '多晶双玻',
      '单晶四栅60片', '单晶四栅72片', '多晶四栅60片', '多晶四栅72片'],
    hideSameItem: '隐藏相同项',
    labelBestItem: '标示最优项',
    dataLoading: '数据加载中...',
    selectComTime: '选择对比时间点',
    chooseDev2: '+ 选择设备',
    staticInf: '静态信息',
    runNum: '运行数据',
    parameterConfig: '参数配置',
    selectGroupInv: '请选择组串式逆变器',
    devHave: '设备已存在',
    remove: '移除',
    noData: '无数据',
  }
}
