largeScreen = {}
largeScreen.D = module.exports.D = {
  testData: {
    'realTimePower': {
      'total': {
        'power': [0, 0, 26.04, 50.4, 73.92, 87.36, 153.72, 194.88, 230.16, 276.36, 376.32, 441, 580.44, 644.28, 723.24, 797.16, 887.04, 956.76, 1063.44, 1146.6, 1242.36, 1348.2, 1417.08, 1496.88, 1621.2, 1698.48, 1768.2, 1824.48, 1940.4, 2023.56, 2097.48, 2197.44, 2239.44, 2320.92, 2439.36, 2499, 2572.92, 2585.52, 2648.52, 2724.12, 2796.36, 2829.96, 2881.2, 2972.76, 3050.88, 3037.44, 3077.76, 3168.48, 3280.2, 3259.2, 3317.16, 3341.52, 3328.08, 3411.24, 3389.4, 3486.84, 3509.52, 3549, 3544.8, 3595.2, 3640.56, 3617.04, 3633.84, 3622.08, 3596.04, 3639.72, 3651.48, 3650.64, 3688.44, 3713.64, 3668.28, 3651.48, 3631.32, 3639.72, 3632.16, 3679.2, 3620.4, 3622.08, 3614.52, 3627.96, 3568.32, 3487.68, 3523.8, 3490.2, 3461.64, 3417.12, 3412.92, 3308.76, 3323.04, 3251.64, 3238.2, 3208.8, 3135.72, 3092.04, 3044.16, 2966.04, 2936.64, 2829.12, 2892.12, 2760.24, 2744.28, 2666.16, 2583, 2461.2, 2445.24, 2354.52, 2236.08, 2233.56, 1764, 2144.52, 2045.4, 1947.12, 1722.84, 1447.32, 1591.8, 1701.84, 1570.8, 868.56, 1193.64, 1393.56, 1223.88, 1109.64, 1029.84, 882.84, 528.36, 612.36, 272.16, 262.92, 381.36, 535.08, 540.96, 366.24, 246.96, 210.84, 185.64, 155.4, 132.72, 91.56, 59.64, 31.08, 6.72, 76.44, 61.32, 53.76, 45.36, 0, 0],
        'time': ['5:40', '5:45', '5:50', '5:55', '6:00', '6:05', '6:10', '6:15', '6:20', '6:25', '6:30', '6:35', '6:40', '6:45', '6:50', '6:55', '7:00', '7:05', '7:10', '7:15', '7:20', '7:25', '7:30', '7:35', '7:40', '7:45', '7:50', '7:55', '8:00', '8:05', '8:10', '8:15', '8:20', '8:25', '8:30', '8:35', '8:40', '8:45', '8:50', '8:55', '9:00', '9:05', '9:10', '9:15', '9:20', '9:25', '9:30', '9:35', '9:40', '9:45', '9:50', '9:55', '10:00', '10:05', '10:10', '10:15', '10:20', '10:25', '10:30', '10:35', '10:40', '10:45', '10:50', '10:55', '11:00', '11:05', '11:10', '11:15', '11:20', '11:25', '11:30', '11:35', '11:40', '11:45', '11:50', '11:55', '12:00', '12:05', '12:10', '12:15', '12:20', '12:25', '12:30', '12:35', '12:40', '12:45', '12:50', '12:55', '13:00', '13:05', '13:10', '13:15', '13:20', '13:25', '13:30', '13:35', '13:40', '13:45', '13:50', '13:55', '14:00', '14:05', '14:10', '14:15', '14:20', '14:25', '14:30', '14:35', '14:40', '14:45', '14:50', '14:55', '15:00', '15:05', '15:10', '15:15', '15:20', '15:25', '15:30', '15:35', '15:40', '15:45', '15:50', '15:55', '16:00', '16:05', '16:10', '16:15', '16:20', '16:25', '16:30', '16:35', '16:40', '16:45', '16:50', '16:55', '17:00', '17:05', '17:10', '17:15', '17:20', '17:25', '17:30', '17:35', '17:40', '17:45', '17:50', '17:55', '18:00', '18:05', '18:10', '18:15', '18:20', '18:25', '18:30', '18:35', '18:40', '18:45', '18:50', '18:55', '19:00', '19:05', '19:10', '19:15', '19:20', '19:25', '19:30', '19:35', '19:40'],
      },
      '1001': {
        'power': [0.020, 12.314, 25.136, 37.272, 49.990, 62.789, 75.188, 87.319, 99.966, 112.746, 124.800, 137.625, 150.158, 162.435, 175.054, 187.381, 199.439, 212.112, 224.552, 237.487, 250.027, 263.038, 275.965, 288.880, 301.763, 314.199, 326.991, 339.634, 352.055, 364.312, 377.122, 390.070, 402.445, 415.448, 427.823, 440.001, 452.704, 465.230, 478.171, 490.753, 503.624, 516.031, 529.002, 541.692, 553.717, 566.611, 579.433, 591.477, 604.100, 617.061, 629.514, 641.613, 654.193, 666.310, 678.633, 690.830, 703.548, 715.986, 728.085, 740.321, 752.414, 765.277, 813.277, 861.034, 908.883, 956.401, 1003.712, 1051.490, 1099.266, 1146.460, 1194.257, 1241.603, 1289.216, 1337.004, 1384.680, 3544.714, 3545.714, 3670.226, 3672.099, 3649.149, 3642.210, 3631.450, 3684.672, 3626.469, 3687.466, 3584.373, 3695.266, 3559.880, 3683.396, 3638.552, 3593.688, 3549.597, 3505.203, 3461.062, 3416.483, 3371.625, 3326.631, 3282.366, 3237.807, 3193.468, 2386.768, 2342.202, 2297.234, 2252.409, 2208.149, 2163.695, 2119.351, 2075.267, 2031.209, 1986.956, 1942.391, 1897.630, 1853.044, 1808.361, 1763.865, 1719.450, 1675.077, 1631.022, 1586.413, 1542.011, 1497.066, 1452.883, 1408.691, 1364.113, 1319.246, 1274.355, 1230.095, 1185.394, 1140.935, 1095.964, 1051.761, 1006.908, 962.303, 917.370, 872.819, 828.763, 784.391, 739.949, 695.873, 651.377, 606.872, 562.620, 517.741, 473.588, 429.254, 384.923, 340.480, 295.952, 35.079, 31.080, 27.281, 23.461, 19.265, 15.700, 11.756, 7.726, 3.449, -0.767, 0.826, 0.598, 1.020, 0.705, 0.792, 1.015, 0.694, 0.401, 0.926, 0.023, 0.001, 0.020, 12.314, 25.136, 37.272, 49.990, 62.789, 75.188, 87.319, 99.966, 112.746, 124.800, 137.625, 150.158, 162.435, 175.054, 187.381, 199.439, 212.112, 224.552, 237.487, 250.027, 263.038, 275.965, 288.880, 301.763, 314.199, 326.991, 339.634, 352.055, 364.312, 377.122, 390.070, 402.445, 415.448, 427.823, 440.001, 452.704, 465.230, 478.171, 490.753, 503.624, 516.031, 529.002, 541.692, 553.717, 566.611, 579.433, 591.477, 604.100, 617.061, 629.514, 641.613, 654.193, 666.310, 678.633, 690.830, 703.548, 715.986, 728.085, 740.321, 752.414, 765.277, 813.277, 861.034, 908.883, 956.401, 1003.712, 1051.490, 1099.266, 1146.460, 1194.257, 1241.603, 1289.216, 1337.004, 1384.680, 3544.714, 3545.714, 3670.226, 3672.099, 3649.149, 3642.210, 3631.450, 3684.672, 3626.469, 3687.466, 3584.373, 3695.266, 3559.880, 3683.396, 3638.552, 3593.688, 3549.597, 3505.203, 3461.062, 3416.483, 3371.625, 3326.631, 3282.366, 3237.807, 3193.468, 2386.768, 2342.202, 2297.234, 2252.409, 2208.149, 2163.695, 2119.351, 2075.267, 2031.209, 1986.956, 1942.391, 1897.630, 1853.044, 1808.361, 1763.865, 1719.450, 1675.077, 1631.022, 1586.413, 1542.011, 1497.066, 1452.883, 1408.691, 1364.113, 1319.246, 1274.355, 1230.095, 1185.394, 1140.935, 1095.964, 1051.761, 1006.908, 962.303, 917.370, 872.819, 828.763, 784.391, 739.949, 695.873, 651.377, 606.872, 562.620, 517.741, 473.588, 429.254, 384.923, 340.480, 295.952, 35.079, 31.080, 27.281, 23.461, 19.265, 15.700, 11.756, 7.726, 3.449, -0.767, 0.826, 0.598, 1.020, 0.705, 0.792, 1.015, 0.694, 0.401, 0.926, 0.023, 0.001],
        'time': ['5:40', '5:45', '5:50', '5:55', '6:00', '6:05', '6:10', '6:15', '6:20', '6:25', '6:30', '6:35', '6:40', '6:45', '6:50', '6:55', '7:00', '7:05', '7:10', '7:15', '7:20', '7:25', '7:30', '7:35', '7:40', '7:45', '7:50', '7:55', '8:00', '8:05', '8:10', '8:15', '8:20', '8:25', '8:30', '8:35', '8:40', '8:45', '8:50', '8:55', '9:00', '9:05', '9:10', '9:15', '9:20', '9:25', '9:30', '9:35', '9:40', '9:45', '9:50', '9:55', '10:00', '10:05', '10:10', '10:15', '10:20', '10:25', '10:30', '10:35', '10:40', '10:45', '10:50', '10:55', '11:00', '11:05', '11:10', '11:15', '11:20', '11:25', '11:30', '11:35', '11:40', '11:45', '11:50', '11:55', '12:00', '12:05', '12:10', '12:15', '12:20', '12:25', '12:30', '12:35', '12:40', '12:45', '12:50', '12:55', '13:00', '13:05', '13:10', '13:15', '13:20', '13:25', '13:30', '13:35', '13:40', '13:45', '13:50', '13:55', '14:00', '14:05', '14:10', '14:15', '14:20', '14:25', '14:30', '14:35', '14:40', '14:45', '14:50', '14:55', '15:00', '15:05', '15:10', '15:15', '15:20', '15:25', '15:30', '15:35', '15:40', '15:45', '15:50', '15:55', '16:00', '16:05', '16:10', '16:15', '16:20', '16:25', '16:30', '16:35', '16:40', '16:45', '16:50', '16:55', '17:00', '17:05', '17:10', '17:15', '17:20', '17:25', '17:30', '17:35', '17:40', '17:45', '17:50', '17:55', '18:00', '18:05', '18:10', '18:15', '18:20', '18:25', '18:30', '18:35', '18:40', '18:45', '18:50', '18:55', '19:00', '19:05', '19:10', '19:15', '19:20', '19:25', '19:30', '19:35', '19:40'],
      },
      '1009': {
        'power': [0.020, 12.314, 25.136, 37.272, 49.990, 62.789, 75.188, 87.319, 99.966, 112.746, 124.800, 137.625, 150.158, 162.435, 175.054, 187.381, 199.439, 212.112, 224.552, 237.487, 250.027, 263.038, 275.965, 288.880, 301.763, 314.199, 326.991, 339.634, 352.055, 364.312, 377.122, 390.070, 402.445, 415.448, 427.823, 440.001, 452.704, 465.230, 478.171, 490.753, 503.624, 516.031, 529.002, 541.692, 553.717, 566.611, 579.433, 591.477, 604.100, 617.061, 629.514, 641.613, 654.193, 666.310, 678.633, 690.830, 703.548, 715.986, 728.085, 740.321, 752.414, 765.277, 813.277, 861.034, 908.883, 956.401, 1003.712, 1051.490, 1099.266, 1146.460, 1194.257, 1241.603, 1289.216, 1337.004, 1384.680, 3544.714, 3545.714, 3670.226, 3672.099, 3649.149, 3642.210, 3631.450, 3684.672, 3626.469, 3687.466, 3584.373, 3695.266, 3559.880, 3683.396, 3638.552, 3593.688, 3549.597, 3505.203, 3461.062, 3416.483, 3371.625, 3326.631, 3282.366, 3237.807, 3193.468, 2386.768, 2342.202, 2297.234, 2252.409, 2208.149, 2163.695, 2119.351, 2075.267, 2031.209, 1986.956, 1942.391, 1897.630, 1853.044, 1808.361, 1763.865, 1719.450, 1675.077, 1631.022, 1586.413, 1542.011, 1497.066, 1452.883, 1408.691, 1364.113, 1319.246, 1274.355, 1230.095, 1185.394, 1140.935, 1095.964, 1051.761, 1006.908, 962.303, 917.370, 872.819, 828.763, 784.391, 739.949, 695.873, 651.377, 606.872, 562.620, 517.741, 473.588, 429.254, 384.923, 340.480, 295.952, 35.079, 31.080, 27.281, 23.461, 19.265, 15.700, 11.756, 7.726, 3.449, -0.767, 0.826, 0.598, 1.020, 0.705, 0.792, 1.015, 0.694, 0.401, 0.926, 0.023, 0.001, 0.020, 12.314, 25.136, 37.272, 49.990, 62.789, 75.188, 87.319, 99.966, 112.746, 124.800, 137.625, 150.158, 162.435, 175.054, 187.381, 199.439, 212.112, 224.552, 237.487, 250.027, 263.038, 275.965, 288.880, 301.763, 314.199, 326.991, 339.634, 352.055, 364.312, 377.122, 390.070, 402.445, 415.448, 427.823, 440.001, 452.704, 465.230, 478.171, 490.753, 503.624, 516.031, 529.002, 541.692, 553.717, 566.611, 579.433, 591.477, 604.100, 617.061, 629.514, 641.613, 654.193, 666.310, 678.633, 690.830, 703.548, 715.986, 728.085, 740.321, 752.414, 765.277, 813.277, 861.034, 908.883, 956.401, 1003.712, 1051.490, 1099.266, 1146.460, 1194.257, 1241.603, 1289.216, 1337.004, 1384.680, 3544.714, 3545.714, 3670.226, 3672.099, 3649.149, 3642.210, 3631.450, 3684.672, 3626.469, 3687.466, 3584.373, 3695.266, 3559.880, 3683.396, 3638.552, 3593.688, 3549.597, 3505.203, 3461.062, 3416.483, 3371.625, 3326.631, 3282.366, 3237.807, 3193.468, 2386.768, 2342.202, 2297.234, 2252.409, 2208.149, 2163.695, 2119.351, 2075.267, 2031.209, 1986.956, 1942.391, 1897.630, 1853.044, 1808.361, 1763.865, 1719.450, 1675.077, 1631.022, 1586.413, 1542.011, 1497.066, 1452.883, 1408.691, 1364.113, 1319.246, 1274.355, 1230.095, 1185.394, 1140.935, 1095.964, 1051.761, 1006.908, 962.303, 917.370, 872.819, 828.763, 784.391, 739.949, 695.873, 651.377, 606.872, 562.620, 517.741, 473.588, 429.254, 384.923, 340.480, 295.952, 35.079, 31.080, 27.281, 23.461, 19.265, 15.700, 11.756, 7.726, 3.449, -0.767, 0.826, 0.598, 1.020, 0.705, 0.792, 1.015, 0.694, 0.401, 0.926, 0.023, 0.001],
        'time': ['5:40', '5:45', '5:50', '5:55', '6:00', '6:05', '6:10', '6:15', '6:20', '6:25', '6:30', '6:35', '6:40', '6:45', '6:50', '6:55', '7:00', '7:05', '7:10', '7:15', '7:20', '7:25', '7:30', '7:35', '7:40', '7:45', '7:50', '7:55', '8:00', '8:05', '8:10', '8:15', '8:20', '8:25', '8:30', '8:35', '8:40', '8:45', '8:50', '8:55', '9:00', '9:05', '9:10', '9:15', '9:20', '9:25', '9:30', '9:35', '9:40', '9:45', '9:50', '9:55', '10:00', '10:05', '10:10', '10:15', '10:20', '10:25', '10:30', '10:35', '10:40', '10:45', '10:50', '10:55', '11:00', '11:05', '11:10', '11:15', '11:20', '11:25', '11:30', '11:35', '11:40', '11:45', '11:50', '11:55', '12:00', '12:05', '12:10', '12:15', '12:20', '12:25', '12:30', '12:35', '12:40', '12:45', '12:50', '12:55', '13:00', '13:05', '13:10', '13:15', '13:20', '13:25', '13:30', '13:35', '13:40', '13:45', '13:50', '13:55', '14:00', '14:05', '14:10', '14:15', '14:20', '14:25', '14:30', '14:35', '14:40', '14:45', '14:50', '14:55', '15:00', '15:05', '15:10', '15:15', '15:20', '15:25', '15:30', '15:35', '15:40', '15:45', '15:50', '15:55', '16:00', '16:05', '16:10', '16:15', '16:20', '16:25', '16:30', '16:35', '16:40', '16:45', '16:50', '16:55', '17:00', '17:05', '17:10', '17:15', '17:20', '17:25', '17:30', '17:35', '17:40', '17:45', '17:50', '17:55', '18:00', '18:05', '18:10', '18:15', '18:20', '18:25', '18:30', '18:35', '18:40', '18:45', '18:50', '18:55', '19:00', '19:05', '19:10', '19:15', '19:20', '19:25', '19:30', '19:35', '19:40'],
      }
    },
  }
}
largeScreen.M = module.exports.M = {
  getDayActivePowerList: function (stationCode) {
    let time = new Date()
    let h = time.getHours()
    let m = time.getMinutes()
    let r = Math.floor(m / 5)
    let newTime = h + ':' + ((r * 5) < 10 ? '0' + (r * 5) : (r * 5))
    let index = largeScreen.D.testData.realTimePower[stationCode || 'total'].time.indexOf(newTime)
    let powers = largeScreen.D.testData.realTimePower[stationCode || 'total'].power.slice(0, index + 1)
    let times = largeScreen.D.testData.realTimePower[stationCode || 'total'].time.slice(0, index + 1)

    let result = {}
    for (let i = 0; i <= index; i++) {
      let hm = times[i].split(':')
      let t = new Date(time.getFullYear(), time.getMonth(), time.getDate(), hm[0], hm[1]).getTime()
      let p = powers[i]
      result[t] = p
    }

    return result
  },
  getCurrentRealTimePower: function (stationCode) {
    let time = new Date()
    let h = time.getHours()
    let m = time.getMinutes()
    let r = Math.floor(m / 5)
    let newTime = h + ':' + ((r * 5) < 10 ? '0' + (r * 5) : (r * 5))
    let index = largeScreen.D.testData.realTimePower[stationCode || 'total'].time.indexOf(newTime)
    return largeScreen.D.testData.realTimePower[stationCode || 'total'].power[index]
  }
}
module.exports.R = {
  getCommonData: function (options) {
    let params = JSON.parse(options.body)

    if (params.queryId === 1 && params.queryType === 1) { // 上能
      return {
        'code': 1,
        'message': 'SUCCESS',
        'results': {
          'currentTime': 0,
          'safeRunDays': 301,
          'capacity': 23060,
          'equipmentQuantity': 23614,
          'allTaskCount': 20,
          'notFinishTaskCount': 8,
        }
      }
    }

    if (params.queryId === 1 && params.queryType === 2) { // 广东
      return {
        'code': 1,
        'message': 'SUCCESS',
        'results': {
          'currentTime': 0,
          'safeRunDays': 301,
          'capacity': 16000,
          'equipmentQuantity': 20250,
          'allTaskCount': 10,
          'notFinishTaskCount': 5,
        }
      }
    }
    if (params.queryId === 2 && params.queryType === 2) { // 江苏
      return {
        'code': 1,
        'message': 'SUCCESS',
        'results': {
          'currentTime': 0,
          'safeRunDays': 257,
          'capacity': 7065,
          'equipmentQuantity': 3119,
          'allTaskCount': 8,
          'notFinishTaskCount': 2,
        }
      }
    }
    if (params.queryId === 3 && params.queryType === 2) { // 河南
      return {
        'code': 1,
        'message': 'SUCCESS',
        'results': {
          'currentTime': 0,
          'safeRunDays': 53,
          'capacity': 600,
          'equipmentQuantity': 2265,
          'allTaskCount': 2,
          'notFinishTaskCount': 2,
        }
      }
    }

    if (params.queryId === '1001' && params.queryType === 3) { // 河南电站
      return {
        'code': 1,
        'message': 'SUCCESS',
        'results': {
          'currentTime': 0,
          'safeRunDays': 53,
          'capacity': 600,
          'equipmentQuantity': 2265,
          'allTaskCount': 2,
          'notFinishTaskCount': 2,
        }
      }
    }
    if (params.queryId === '1009' && params.queryType === 3) { // 宿迁
      return {
        'code': 1,
        'message': 'SUCCESS',
        'results': {
          'currentTime': 0,
          'safeRunDays': 52,
          'capacity': 19,
          'equipmentQuantity': 68,
          'allTaskCount': 2,
          'notFinishTaskCount': 2,
        }
      }
    }
    if (params.queryType === 3) {
      return {
        'code': 1,
        'message': 'SUCCESS',
        'results': {
          'currentTime': 0,
          'safeRunDays': 53,
          'capacity': 600,
          'equipmentQuantity': 2265,
          'allTaskCount': 2,
          'notFinishTaskCount': 2,
        }
      }
    }
    return {
      'code': 1,
      'message': 'SUCCESS',
      'results': {
        'currentTime': 0,
        'safeRunDays': 301,
        'capacity': 23060,
        'equipmentQuantity': 23614,
        'allTaskCount': 20,
        'notFinishTaskCount': 8,
      }
    }
  },
  getPowerGeneration: function (options) {
    var params = JSON.parse(options.body) || {}

    if (params.queryId === 1 && params.queryType === 1) { // 上能
      return {
        'code': 1,
        'message': 'SUCCESS',
        'results': {
          capacity: {max: 50000000, value: 14255082.295},
          totalPower: {max: 50000000, value: 14255082.295},
          ongridPower: {max: 50000000, value: 14255082.295},
          activePower: {
            max: 50000,
            value: 17059.525 + (Math.random() > 0.5 ? -1 * Math.random() * 200 : Math.random() * 200)
          },
          dayCap: {max: 200000, value: 90427.979},
          dayIncome: {max: 200000, value: 94949.38},
          totalIncome: {max: 20000000, value: 14967836.41},
        }
      }
    }

    if (params.queryId === 1 && params.queryType === 2) { // 广东
      return {
        'code': 1,
        'message': 'SUCCESS',
        'results': {
          capacity: {max: 50000000, value: 12208095.541},
          totalPower: {max: 50000000, value: 12208095.541},
          ongridPower: {max: 50000000, value: 12208095.541},
          activePower: {
            max: 50000,
            value: 11471.176 + (Math.random() > 0.5 ? -1 * Math.random() * 200 : Math.random() * 200)
          },
          dayCap: {max: 150000, value: 65916.656},
          dayIncome: {max: 150000, value: 69212.49},
          totalIncome: {max: 15000000, value: 12818500.32},
        }
      }
    }
    if (params.queryId === 2 && params.queryType === 2) { // 江苏
      return {
        'code': 1,
        'message': 'SUCCESS',
        'results': {
          capacity: {max: 5000000, value: 2046986.754},
          totalPower: {max: 5000000, value: 2046986.754},
          ongridPower: {max: 5000000, value: 2046986.754},
          activePower: {
            max: 50000,
            value: 5588.349 + (Math.random() > 0.5 ? -1 * Math.random() * 100 : Math.random() * 100)
          },
          dayCap: {max: 50000, value: 24511.324},
          dayIncome: {max: 50000, value: 25736.38},
          totalIncome: {max: 5000000, value: 2149336.41},
        }
      }
    }
    if (params.queryId === 3 && params.queryType === 2) { // 河南
      return {
        'code': 1,
        'message': 'SUCCESS',
        'results': {
          capacity: {max: 500000, value: 165478.270},
          totalPower: {max: 500000, value: 165478.270},
          ongridPower: {max: 500000, value: 165478.270},
          activePower: {
            max: 800,
            value: 497.870 + (Math.random() > 0.5 ? -1 * Math.random() * 2 : Math.random() * 2)
          },
          dayCap: {max: 5000, value: 1803.280},
          dayIncome: {max: 5000, value: 1713.78},
          totalIncome: {max: 500000, value: 138204.41},
        }
      }
    }

    if (params.queryId === '1001' && params.queryType === 3) { // 河南电站
      return {
        'code': 1,
        'message': 'SUCCESS',
        'results': {
          capacity: {max: 500000, value: 165478.270},
          totalPower: {max: 500000, value: 165478.270},
          ongridPower: {max: 500000, value: 165478.270},
          activePower: {
            max: 800,
            value: 497.870 + (Math.random() > 0.5 ? -1 * Math.random() * 2 : Math.random() * 2)
          },
          dayCap: {max: 5000, value: 1803.280},
          dayIncome: {max: 5000, value: 1713.78},
          totalIncome: {max: 500000, value: 138204.41},
        }
      }
    }
    if (params.queryId === '1009' && params.queryType === 3) { // 宿迁
      return {
        'code': 1,
        'message': 'SUCCESS',
        'results': {
          capacity: {max: 5000, value: 1456.466},
          totalPower: {max: 5000, value: 1456.466},
          ongridPower: {max: 5000, value: 1456.466},
          activePower: {
            max: 5,
            value: 4.300 + (Math.random() > 0.5 ? -1 * Math.random() * 0.2 : Math.random() * 0.2)
          },
          dayCap: {max: 60, value: 22.570},
          dayIncome: {max: 60, value: 23.78},
          totalIncome: {max: 5000, value: 1529.29},
        }
      }
    }
    if (params.queryType === 3) {
      return {
        'code': 1,
        'message': 'SUCCESS',
        'results': {
          capacity: {max: 50000000, value: 14255082.295},
          totalPower: {max: 50000000, value: 14255082.295},
          ongridPower: {max: 50000000, value: 14255082.295},
          activePower: {
            max: 50000,
            value: 17059.525 + (Math.random() > 0.5 ? -1 * Math.random() * 200 : Math.random() * 200)
          },
          dayCap: {max: 200000, value: 90427.979},
          dayIncome: {max: 200000, value: 94949.38},
          totalIncome: {max: 20000000, value: 14967836.41},
        }
      }
    }
    return {
      'code': 1,
      'message': 'SUCCESS',
      'results': {
        capacity: {max: 50000000, value: 14255082.295},
        totalPower: {max: 50000000, value: 14255082.295},
        ongridPower: {max: 50000000, value: 14255082.295},
        activePower: {
          max: 50000,
          value: 17059.525 + (Math.random() > 0.5 ? -1 * Math.random() * 200 : Math.random() * 200)
        },
        dayCap: {max: 200000, value: 90427.979},
        dayIncome: {max: 200000, value: 94949.38},
        totalIncome: {max: 20000000, value: 14967836.41},
      }
    }
  },
  getPowerTrends: function (options) {
    function getDate (str, dim) {
      var time = new Date(str)
      if (dim === 'm') {
        time.setHours(0, 0, 0, 0)
      }
      if (dim === 'y') {
        time.setDate(1)
      }
      if (dim === 'aY') {
        time.setMonth(0)
        time.setDate(1)
      }
      time.setHours(0, 0, 0, 0)
      return time.getTime()
    }

    function getMonthStr () {
      let date = new Date()
      let year = date.getFullYear()
      let month = date.getMonth() + 1
      if (month < 10) {
        month = '0' + month
      }
      return year + '-' + month
    }

    function getPowerAndIncome () {
      let results = []
      let monthPowerArr = [28785.261, 29707.507, 23759.375, 22074.003, 29668.497, 25690.560, 21146.973, 22670.618, 26008.682, 23411.439, 25366.933, 26264.735, 29981.043, 29923.780, 22418.025, 27606.345, 26036.794, 29696.423, 21796.408, 28528.663, 29810.682, 22312.439, 24986.679, 26260.461, 28403.075, 29873.529, 28592.430, 28545.833, 26511.302, 23223.865, 29044.693]
      let monthInComeArr = [27806.56, 28697.45, 22951.56, 21323.49, 28659.77, 24817.08, 20427.98, 21899.82, 25124.39, 22615.45, 24504.46, 25371.73, 28961.69, 28906.37, 21655.81, 26667.73, 25151.54, 28686.74, 21055.33, 27558.69, 28797.12, 21553.82, 24137.13, 25367.61, 27437.37, 28857.83, 27620.29, 27575.27, 25609.92, 22434.25, 28057.17]
      let myDate = new Date().getDate()
      for (let i = 0; i < myDate; i++) {
        let str = i + 1
        if (str < 10) {
          str = '0' + str
        }
        results.push({
          'collectTime': getDate(getMonthStr() + '-' + str, 'm'),
          'powerProfit': monthInComeArr[i],
          'productPower': monthPowerArr[i]
        })
      }
      return results
    }

    return {
      'code': 1,
      'message': 'SUCCESS',
      'results': {
        powerTrends: getPowerAndIncome()
      }
    }
  },
  getListStationInfo: {
    'code': 1,
    'message': 'SUCCESS',
    'results': {
      'stationInfoList': {
        's0to5': 0,
        's5to10': 1,
        's10to100': 3,
        's100to500': 0,
        's500up': 6
      }
    }
  },
  getActivePower: function (options) {
    var stationCode = JSON.parse(options.body).stationCode
    return {
      'code': 1,
      'message': 'SUCCESS',
      'results': {
        'currentPower': largeScreen.M.getCurrentRealTimePower(stationCode),
        'dayActivePowerList': largeScreen.M.getDayActivePowerList(stationCode)
      }
    }
  },
  getMapShowData: function (options) {
    var body = JSON.parse(options.body) || {}
    if (+body.queryId === 1 && +body.queryType === 1) {
      return {
        'code': 1,
        'message': 'SUCCSESS',
        'results': {
          'currentShowData|3': [
            {
              'id|+1': 1,
              'name|+1': ['广东省', '江苏省', '河南'],
              'nodeType': 2,
              'latitude|+1': [22.638424, 31.335567, 34.674346],
              'longitude|+1': [113.828992, 120.58192, 113.597429],
              'capacity|1': 11222,
            },
          ],
          'domainTree': [
            {
              'id': 1,
              'name': '上能新能源有限公司',
              'nodeType': 1
            }
          ],
          'id': 1,
          'name': '上能新能源有限公司',
          'nodeType': 1,
          'latitude': 30.335567,
          'longitude': 113.58192,
          'radius': 2800000
        }
      }
    } else if (+body.queryId === 2 && +body.queryType === 1) {
      return {
        'code': 1,
        'message': 'SUCCSESS',
        'results': {
          'currentShowData|3': [
            {
              'id|+1': ['1002', '1003', '1004', '1005', '1006', '1009'],
              'name|+1': ['江苏镇江光伏电站', '无锡分布式光伏电站', '无锡户用光伏站A', '无锡户用光伏站B', '江阴户用光伏站', '宿迁宿城户用电站'],
              'nodeType': 3,
              'latitude|+1': [32.211399, 31.529614, 31.757708, 31.880759, 31.900381, 33.960774],
              'longitude|+1': [119.491862, 120.290317, 120.464373, 120.750946, 120.225473, 118.228585],
              'capacity|+1': [1000, 6000, 19, 20, 21, 5],
              'combinedType|+1': [1, 2, 3, 3, 3, 3],
              'stationType': 3,
            },
          ],
          'domainTree': [
            {
              'id': 1,
              'name': '西府联创有限公司',
              'nodeType': 1
            }
          ],
          'id': 1,
          'name': '西府联创有限公司',
          'nodeType': 1,
          'latitude': 30.9835567,
          'longitude': 104.608192,
          'radius': 2800000
        }
      }
    } else if (+body.queryId === 3 && +body.queryType === 1) {
      return {
        'code': 1,
        'message': 'SUCCSESS',
        'results': {
          'currentShowData|3': [
            {
              'id|+1': 1,
              'name|+1': ['广东省', '江苏省', '河南'],
              'nodeType': 2,
              'latitude|+1': [22.638424, 31.335567, 34.674346],
              'longitude|+1': [113.828992, 120.58192, 113.597429],
              'capacity|1': 11222,
            },
          ],
          'domainTree': [
            {
              'id': 1,
              'name': '上能新能源有限公司',
              'nodeType': 1
            }
          ],
          'id': 1,
          'name': '上能新能源有限公司',
          'nodeType': 1,
          'latitude': 30.335567,
          'longitude': 113.58192,
          'radius': 2800000
        }
      }
    } else if (+body.queryId === 1 && +body.queryType === 2) {
      return {
        'code': 1,
        'message': 'SUCCSESS',
        'results': {
          'currentShowData|3': [
            {
              'id|+1': ['1001', '1002', '1003'],
              'name|+1': ['深圳机场分布式电站', '广州大学城分布式电站', '广州龙穴岛分布式电站'],
              'nodeType': 3,
              'latitude|+1': [22.628159, 23.065072, 22.692077],
              'longitude|+1': [113.818959, 113.411938, 113.651277],
              'capacity|+1': [5000, 3000, 8000],
              'combinedType|+1': [2, 2, 2],
              'stationType': 3,
              'runDate|+1': [new Date('2017-07-03'), new Date('2017-10-05'), new Date('2017-09-08')],
              'safeRunningDays|+1': [301, 213, 256],
              'address|+1': ['广东深圳市宝安区', '广东省广州大学城', '广东省广州市龙穴岛'],
              'description|+1': [
                '位于广东深圳市宝安区，建设于屋顶全量上网。电站初建于2016年5月，于2018年1月完成所有屋顶建设及并网。',
                '位于广东省广州大学城，建设于大学城教学楼屋顶电站投产于2017年10月',
                '位于广东省广州市龙穴岛，电站建设于商业屋顶，充分利用闲置屋顶及当地良好的光照条件建设电站，全量上网。投产于2017年9月。'
              ],
              'gridPowerDay|+1': [23032.645, 10953.405, 31930.605],
              'gridPowerMonth|+1': [644914.073, 306695.347, 894056.941],
              'gridPowerYear|+1': [2740884.811, 1303455.223, 3799741.998],
            },
          ],
          'domainTree': [
            {
              'id': 1,
              'name': '上能新能源有限公司',
              'nodeType': 1
            },
            {
              'id': 1,
              'name': '广东省',
              'nodeType': 2
            }
          ],
          'id': 1,
          'latitude': 22.638424,
          'longitude': 113.828992,
          'name': '广东省',
          'nodeType': 2,
          'radius': 285000
        }
      }
    } else if (+body.queryId === 2 && +body.queryType === 2) {
      return {
        'code': 1,
        'message': 'SUCCSESS',
        'results': {
          'currentShowData|6': [
            {
              'id|+1': ['1002', '1003', '1004', '1005', '1006', '1009'],
              'name|+1': ['江苏镇江光伏电站', '无锡分布式光伏电站', '无锡户用光伏站A', '无锡户用光伏站B', '江阴户用光伏站', '宿迁宿城户用电站'],
              'nodeType': 3,
              'latitude|+1': [32.211399, 31.529614, 31.757708, 31.880759, 31.900381, 33.960774],
              'longitude|+1': [119.491862, 120.290317, 120.464373, 120.750946, 120.225473, 118.228585],
              'capacity|+1': [1000, 6000, 19, 20, 21, 5],
              'combinedType|+1': [1, 2, 3, 3, 3, 3],
              'stationType': 3,
              'runDate|+1': [new Date('2017-07-03'), new Date('2017-09-09'), new Date('2018-02-10'), new Date('2017-12-02'), new Date('2017-12-03'), new Date('2017-12-04'), new Date('2018-04-06')],
              'safeRunningDays|+1': [257, 86, 185, 186, 187, 52],
              'address|+1': ['江苏省镇江市某某度假山庄', '江苏省无锡市', '江苏无锡荷塘镇', '江苏无锡农场镇', '江苏江阴某镇', '江苏省宿迁市宿城区祠堂路238号'],
              'description|+1': [
                '位于江苏省镇江市某某度假山庄内，利用山庄闲置屋顶，建设分布式电站，除山庄内部消纳外，余电上网。电站投产于2017年9月。',
                '位于江苏省无锡市，电站建设于鱼塘，属鱼光互补型光伏电站充分利用了鱼塘闲置领空。投产于2017年9月。',
                '位于江苏无锡荷塘镇，某居民自建房屋屋顶，属自发自用，余电上网型户用电站，投产于2017年12月。采用组串式逆变器。',
                '位于江苏无锡农场镇，某居民自建房屋屋顶，属自发自用，余电上网型户用电站，投产于2017年12月。采用组串式逆变器。',
                '位于江苏江阴某镇，某居民自建房屋屋顶，属自发自用，余电上网型户用电站，投产于2017年12月。采用组串式逆变器。',
                '位于江苏省宿迁市宿城区祠堂路238号，居民屋顶自建电站，自发自用，余电上网；电站投产于2018年4月。'
              ],
              'gridPowerDay|+1': [4645.697, 19646.530, 88.425, 73.144, 57.527, 22.570],
              'gridPowerMonth|+1': [130079.522, 550102.837, 2475.901, 2048.041, 1610.757, 787.279],
              'gridPowerYear|+1': [552837.968, 2337937.057, 10522.581, 8704.176, 6845.719, 1456.466],
            },
          ],
          'domainTree': [
            {
              'id': 1,
              'name': '上能新能源有限公司',
              'nodeType': 1
            },
            {
              'id': 2,
              'name': '江苏省',
              'nodeType': 2
            }
          ],
          'id': 2,
          'latitude': 32.811399,
          'longitude': 119.491862,
          'name': '江苏省',
          'nodeType': 2,
          'radius': 420000
        }
      }
    } else if (+body.queryId === 3 && +body.queryType === 2) {
      return {
        'code': 1,
        'message': 'SUCCSESS',
        'results': {
          'currentShowData|1-1': [
            {
              'id|+1': ['1001'],
              'name|+1': ['河南侯寨分布式电站'],
              'nodeType': 3,
              'latitude|+1': [34.674346],
              'longitude|+1': [113.597429],
              'capacity|+1': [600],
              'combinedType|+1': [2],
              'stationType': 3,
              'runDate|+1': [new Date('2018-04-05')],
              'safeRunningDays|+1': [53],
              'address|+1': ['河南省郑州市侯寨乡'],
              'description|+1': ['位于河南省郑州市侯寨乡，余电上网型，投产于2018年4月。采用组串式逆变器，总装机容量600KW。'],
              'gridPowerDay|+1': [1803.260],
              'gridPowerMonth|+1': [72864.361],
              'gridPowerYear|+1': [145478.270],
            },
          ],
          'domainTree': [
            {
              'id': 1,
              'name': '上能新能源有限公司',
              'nodeType': 1
            },
            {
              'id': 3,
              'name': '河南',
              'nodeType': 2
            }
          ],
          'id': 3,
          'latitude': 34.674346,
          'longitude': 113.597429,
          'name': '河南',
          'nodeType': 2,
          'radius': 37000
        }
      }
    } else {
      return {
        'code': 1,
        'message': 'SUCCSESS',
        'results': {
          'currentShowData|3-3': [
            {
              'id|+1': 1,
              'name|+1': ['上能新能源有限公司', '西府联创有限公司', '其实这只是一个名字比较长一点儿的企业而已'],
              'nodeType': 1,
              'latitude|+1': [30.335567, 30.9835567, 38.348723],
              'longitude|+1': [113.58192, 104.608192, 112.128312],
              'capacity|1': 2800000,
            },
          ],
          'domainTree': [],
          'id': null,
          'latitude': null,
          'longitude': null,
          'name': null,
          'nodeType': null,
          'radius': null
        }
      }
    }
  },
  getSocialContribution: {
    'code': 1,
    'message': 'SUCCESS',
    'results': {
      'accumulativeTotal': {
        'carbonEmissions': 5702.03,
        'deforestation': 14212.32,
        'savedCoal': 776629
      },
      'year': {
        'carbonEmissions': 4304.37,
        'deforestation': 10728.65,
        'savedCoal': 586265
      }
    }
  },
  getDeviceCount: {
    'code': 1,
    'message': 'SUCCESS',
    'results': {
      'deviceTotalCount': 23614,
      'pvCount': 23350,
      'combinerBoxCount': 213,
      'inverterConcCount': 2,
      'inverterStringCount': 49
    }
  },
  getTaskStatistics: function (options) {
    let params = JSON.parse(options.body)
    if (params.queryId === '1001' && params.queryType === 3) { // 河南电站
      return {
        'code': 1,
        'message': 'SUCCESS',
        'results': {
          'done': 1,
          'doing': 15,
          'todo': 4,
        }
      }
    }
    if (params.queryId === '1009' && params.queryType === 3) { // 宿迁
      return {
        'code': 1,
        'message': 'SUCCESS',
        'results': {
          'done': 1,
          'doing': 5,
          'todo': 4,
        }
      }
    }
    return {
      'code': 1,
      'message': 'SUCCESS',
      'results': {
        'done': 0,
        'doing': 1,
        'todo': 3,
      }
    }
  }
}
