// 后台数据转换的国际化  中文
export default {
  dataConverter: {
    analysis: { // 智能分析告警模型的国际化 key:alarmId
      1: {
        alarmName: '电站停机', // 告警名称
        suggestion: '1.检查电站是否拉闸关停；', // 修复建议
        cause: '（1）并网状态点断开；（2）分析周期内电站功率为0且所有箱变线电压为0；（3）分析周期内环境监测仪可用且最小辐照强度大于100W/m2 && 分析周期内电站功率为0；（4）分析周期内电站功率为0且所有逆变器直流电压大于400V，直流电流为0A' // 告警原因
      },
      2: {
        alarmName: '箱变停机', // 告警名称
        suggestion: '1.检查箱变是否严重告警；', // 修复建议
        cause: '分析周期内箱变AB、BC、CA线电压全为0 ' // 告警原因
      },
      3: {
        alarmName: '集中式逆变器输出功率为0', // 告警名称
        suggestion: '1、检查逆变器是否存在设备级别告警；\n2、检查逆变器是否停机', // 修复建议
        cause: '分析周期内集中式逆变器发电量小于等于0且最后一个采集时刻点逆变器输出功率小于等于0；' // 告警原因
      },
      4: {
        alarmName: '集中式逆变器低效', // 告警名称
        suggestion: '1.检查设备物理采集模块是否损坏、通信线缆是否损坏或干扰；\n2.检查逆变器是否存在漏电流现象，逆变器MPPT模块是否异常，逆变器转换效率是否偏低，逆变器自耗电是否过大；', // 修复建议
        cause: '逆变器非故障且偏离度小于低效门限；逆变器偏离度=1-|判定逆变器等效利用小时数-电站等效利用小时数| / 电站等效利用小时数' // 告警原因
      },
      5: {
        alarmName: '集中式逆变异常', // 告警名称
        suggestion: '1.检查设备物理采集模块是否损坏、通信线缆是否损坏或干扰；\n2.检查逆变器是否存在漏电流现象，逆变器MPPT模块是否异常，逆变器转换效率是否偏低，逆变器自耗电是否过大；\n3.检查监控装机容量配置是否错误或者接入的错误设备；', // 修复建议
        cause: '' // 告警原因
      },
      6: {
        alarmName: '组串式逆变器输出功率为0', // 告警名称
        suggestion: '1、检查逆变器是否存在设备级别告警；\n2、检查逆变器是否停机', // 修复建议
        cause: ' 当逆变器装机容量非0且不为空时：\n分析周期内逆变器发电量小于等于0且最后一个采集时刻点逆变器输出功率小于等于0；' // 告警原因
      },
      7: {
        alarmName: '组串式逆变器所有PV支路电流为0', // 告警名称
        suggestion: '1.检查设备物理采集模块是否损坏、通信线缆是否损坏或干扰；\n2.检查逆变器是否存在漏电流现象，逆变器MPPT模块是否异常；', // 修复建议
        cause: '当逆变器装机容量非0且不为空时：\n分析周期内逆变器下组串最大输出电流小于等于0.3；' // 告警原因
      },
      8: {
        alarmName: '组串式逆变器所有PV支路电压为0', // 告警名称
        suggestion: '1.检查设备物理采集模块是否损坏、通信线缆是否损坏或干扰；\n2.检查逆变器是否存在漏电流现象，逆变器MPPT模块是否异常；', // 修复建议
        cause: '当逆变器装机容量非0且不为空时：\n分析周期内逆变器下各组串最大输出电压之和小于等于0；' // 告警原因
      },
      9: {
        alarmName: '组串式逆变器低效', // 告警名称
        suggestion: '1.检查设备物理采集模块是否损坏、通信线缆是否损坏或干扰；\n2.检查逆变器是否存在漏电流现象，逆变器MPPT模块是否异常，逆变器转换效率是否偏低，逆变器自耗电是否过大；', // 修复建议
        cause: '逆变器非故障且偏离度小于低效门限；逆变器偏离度=1-|判定逆变器等效利用小时数-子阵等效利用小时数| / 子阵等效利用小时数' // 告警原因
      },
      10: {
        alarmName: '组串式逆变器异常', // 告警名称
        suggestion: '1.检查设备物理采集模块是否损坏、通信线缆是否损坏或干扰；\n2.检查逆变器是否存在漏电流现象，逆变器MPPT模块是否异常，逆变器转换效率是否偏低，逆变器自耗电是否过大；\n3.检查监控装机容量配置是否错误或者接入的错误设备', // 修复建议
        cause: '' // 告警原因
      },
      11: {
        alarmName: '组串式逆变器装机容量为0或空', // 告警名称
        suggestion: '1.检查设备是否应该正常接入；\n2.检查设备是否已配置装机容量；', // 修复建议
        cause: '组串式逆变器装机容量为0或空' // 告警原因
      },
      12: {
        alarmName: '直流汇流箱所有PV支路电流为0', // 告警名称
        suggestion: '1.检查设备物理采集模块是否损坏、通信线缆是否损坏或干扰；\n2.检查汇流箱开路保险是否损坏；', // 修复建议
        cause: '当直流汇流箱装机容量非0且不为空时：\n分析周期内直流汇流箱组串最大输出电流小于等于0.3；' // 告警原因
      },
      13: {
        alarmName: '直流汇流箱电压为0', // 告警名称
        suggestion: '1.检查设备物理采集模块是否损坏、通信线缆是否损坏或干扰；\n2.检查汇流箱开路保险是否损坏；', // 修复建议
        cause: '当直流汇流箱装机容量非0且不为空时：\n分析周期内直流汇流箱最大光伏电压小于等于0' // 告警原因
      },
      14: {
        alarmName: '直流汇流箱异常', // 告警名称
        suggestion: '1.检查设备物理采集模块是否损坏、通信线缆是否损坏或干扰；\n2.检查汇流箱开路保险是否损坏；\n3.检查监控装机容量配置是否错误或者接入的错误设备；', // 修复建议
        cause: '' // 告警原因
      },
      15: {
        alarmName: '直流汇流箱装机容量为0或空', // 告警名称
        suggestion: '1.检查设备是否应该正常接入；\n2.检查设备是否已配置装机容量；', // 修复建议
        cause: '直流汇流箱装机容量为0或空' // 告警原因
      },
      16: {
        alarmName: '组串式逆变器PVX支路断开', // 告警名称
        suggestion: '1.检测组串间MC4插头是否虚接或损坏；\n2.检测光伏组串线路或组件本身是否损坏', // 修复建议
        cause: '分析周期内逆变器最大直流电压>0 且 分析周期内集中式逆变器发电量 <= 0 且 最后一个采集时刻点逆变器输出功率 <= 0' // 告警原因
      },
      17: {
        alarmName: '直流汇流箱PVX支路断开', // 告警名称
        suggestion: '1.检查汇流箱开路保险是否损坏；\n2.检测组串间MC4插头是否虚接或损坏；\n3.检测光伏组串线路或组件本身是否损坏；', // 修复建议
        cause: '分析周期内逆变器最大PV支路电压>0 且 分析周期内组串式逆变器发电量 <= 0 且 最后一个采集时刻点逆变器输出功率 <= 0' // 告警原因
      },
      18: {
        alarmName: '组串式逆变器PVX功率偏低', // 告警名称
        suggestion: '检查光伏组串是否有局部组件热斑、隐裂；', // 修复建议
        cause: '汇流箱无死值 且 分析周期内汇流箱下所有组串最大电流 <= 0.3A' // 告警原因
      },
      19: {
        alarmName: '直流汇流箱PVX功率偏低', // 告警名称
        suggestion: '1.检查光伏组串是否存在遮挡；\n2.检查光伏组串是否灰尘严重；\n3.检查汇流箱开路电压是否偏低；', // 修复建议
        cause: '分析周期内PVX支路最大电流 <= 0.3A 且 离散率 > 10%' // 告警原因
      },
      20: {
        alarmName: '集中式逆变器停机', // 告警名称
        suggestion: '1、检查逆变器是否存在设备级别告警；\n2、检查逆变器是否停机', // 修复建议
        cause: '分析周期内PVX支路最大电流 <=0.3A 且 离散率 >10%' // 告警原因
      },
      21: {
        alarmName: '组串式逆变器停机', // 告警名称
        suggestion: '1、检查逆变器是否存在设备级别告警；\n2、检查逆变器是否停机', // 修复建议
        cause: '组串式逆变器PVX功率偏低（离散率>10% && |P-Avg(P)|/ Avg(P) >组串支路功率偏低阈值门限（默认20%））；功率取电流乘以电压' // 告警原因
      },
      22: {
        alarmName: '直流汇流箱故障', // 告警名称
        suggestion: '1.检查设备物理采集模块是否损坏、通信线缆是否损坏或干扰；\n2.检查汇流箱开路保险是否损坏；\n3.检查监控装机容量配置是否错误或者接入的错误设备；', // 修复建议
        cause: '直流汇流箱PVX功率偏低（离散率>10% && |P-Avg(P)|/ Avg(P) >组串支路功率偏低阈值门限（默认20%））；功率取电流乘以电压' // 告警原因
      },
      23: {
        alarmName: '监控电站断连', // 告警名称
        suggestion: '1.检查监控测服务是否开启；\n2.检查监控测是否修改了配置；\n3.检查监控与集维之间网络是否连通；', // 修复建议
        cause: '未检测到监控连接' // 告警原因
      },
    },
    // 归一化的模型的国际化
    normalized: {
      1: '逆变器状态',
      2: '电网AB电压',
      3: '电网BC电压',
      4: '电网CA电压',
      5: 'A相电压',
      6: 'B相电压',
      7: 'C相电压',
      8: '电网A相电流',
      9: '电网B相电流',
      10: '电网C相电流',
      11: '逆变器转换效率(厂家)',
      12: '机内温度',
      13: '功率因数',
      14: '电网频率',
      15: '有功功率',
      16: '输出无功功率',
      17: '当日发电量',
      18: 'MPPT输入总功率',
      19: 'PV1输入电压',
      20: 'PV2输入电压',
      21: 'PV3输入电压',
      22: 'PV4输入电压',
      23: 'PV5输入电压',
      24: 'PV6输入电压',
      25: 'PV7输入电压',
      26: 'PV8输入电压',
      27: 'PV9输入电压',
      28: 'PV10输入电压',
      29: 'PV11输入电压',
      30: 'PV12输入电压',
      31: 'PV13输入电压',
      32: 'PV14输入电压',
      33: 'PV1输入电流',
      34: 'PV2输入电流',
      35: 'PV3输入电流',
      36: 'PV4输入电流',
      37: 'PV5输入电流',
      38: 'PV6输入电流',
      39: 'PV7输入电流',
      40: 'PV8输入电流',
      41: 'PV9输入电流',
      42: 'PV10输入电流',
      43: 'PV11输入电流',
      44: 'PV12输入电流',
      45: 'PV13输入电流',
      46: 'PV14输入电流',
      47: '累计发电量',
      48: '逆变器开机时间',
      49: '逆变器关机时间',
      50: '直流输入总电量',
      51: 'MPPT1直流累计发电量',
      52: 'MPPT2直流累计发电量',
      53: 'MPPT3直流累计发电量',
      54: 'MPPT4直流累计发电量',
      55: '设备SN',
      58: '电网AB线电压',
      59: '电网BC线电压',
      60: '电网CA线电压',
      61: 'A相电压（交流输出）',
      62: 'B相电压（交流输出）',
      63: 'C相电压（交流输出）',
      64: '电网A相电流(IA)',
      65: '电网B相电流(IB)',
      66: '电网C相电流(IC)',
      67: '有功功率',
      68: '无功功率',
      69: '功率因数',
      70: '电网频率',
      71: '温度',
      72: 'PV温度',
      73: '风速',
      74: '风向',
      75: '总辐射量',
      76: '辐照强度',
      77: '水平辐照强度',
      78: '水平辐照量',
      79: '逆变器状态',
      80: '当日发电量',
      81: '累计发电量',
      82: '机内温度',
      83: '直流电压',
      84: '直流电流',
      85: '第1路电流值',
      86: '第2路电流值',
      87: '第3路电流值',
      88: '第4路电流值',
      89: '第5路电流值',
      90: '第6路电流值',
      91: '第7路电流值',
      92: '第8路电流值',
      93: '第9路电流值',
      94: '第10路电流值',
      95: '直流输入功率',
      96: 'A相电压',
      97: 'B相电压',
      98: 'C相电压',
      99: '电网A相电流',
      100: '电网B相电流',
      101: '电网C相电流',
      102: '功率因数',
      103: '并网频率',
      104: '交流输出功率',
      105: '输出无功功率',
      106: '逆变器开机时间',
      107: '逆变器关机时间',
      108: '生产可靠性',
      109: '第1路电流值',
      110: '第2路电流值',
      111: '第3路电流值',
      112: '第4路电流值',
      113: '第5路电流值',
      114: '第6路电流值',
      115: '第7路电流值',
      116: '第8路电流值',
      117: '第9路电流值',
      118: '第10路电流值',
      119: '第11路电流值',
      120: '第12路电流值',
      121: '第13路电流值',
      122: '第14路电流值',
      123: '第15路电流值',
      124: '第16路电流值',
      125: '第17路电流值',
      126: '第18路电流值',
      127: '第19路电流值',
      128: '第20路电流值',
      129: '光伏电流',
      130: '光伏电压',
      131: '温度',
      132: '雷击次数',
      133: '电网AB线电压',
      134: '电网BC线电压',
      135: '电网CA线电压',
      136: 'A相电压（交流输出）',
      137: 'B相电压（交流输出）',
      138: 'C相电压（交流输出）',
      139: '电网A相电流(IA)',
      140: '电网B相电流(IB)',
      141: '电网C相电流(IC)',
      142: '有功功率',
      143: '功率因数',
      144: '有功电量(正向有功电度)',
      145: '无功功率',
      146: '反向有功电度',
      147: '正向无功电度',
      148: '反向无功电度',
      149: '有功功率PA',
      150: '有功功率PB',
      151: '有功功率PC',
      152: '无功功率QA',
      153: '无功功率QB',
      154: '无功功率QC',
      155: '总视在功率',
      156: '电网频率',
      157: '反向有功电度（峰）',
      158: '反向有功电度（平）',
      159: '反向有功电度（谷）',
      160: '反向有功电度（尖峰）',
      161: '正向有功电度（峰）',
      162: '正向有功电度（平）',
      163: '正向有功电度（谷）',
      164: '正向有功电度（尖峰）',
      165: '反向无功电度（峰）',
      166: '反向无功电度（平）',
      167: '反向无功电度（谷）',
      168: '反向无功电度（尖峰）',
      169: '正向无功电度（峰）',
      170: '正向无功电度（平）',
      171: '正向无功电度（谷）',
      172: '正向无功电度（尖峰）',
      173: '逆变器状态',
      174: '电网AB电压',
      175: '电网BC电压',
      176: '电网CA电压',
      177: 'A相电压',
      178: 'B相电压',
      179: 'C相电压',
      180: '电网A相电流',
      181: '电网B相电流',
      182: '电网C相电流',
      183: '逆变器转换效率(厂家)',
      184: '机内温度',
      185: '功率因数',
      186: '电网频率',
      187: '有功功率',
      188: '输出无功功率',
      189: '当日发电量',
      190: 'MPPT输入总功率',
      191: 'PV1输入电压',
      192: 'PV2输入电压',
      193: 'PV3输入电压',
      194: 'PV4输入电压',
      195: 'PV5输入电压',
      196: 'PV6输入电压',
      197: 'PV7输入电压',
      198: 'PV8输入电压',
      199: 'PV1输入电流',
      200: 'PV2输入电流',
      201: 'PV3输入电流',
      202: 'PV4输入电流',
      203: 'PV5输入电流',
      204: 'PV6输入电流',
      205: 'PV7输入电流',
      206: 'PV8输入电流',
      207: '累计发电量',
      208: '逆变器开机时间',
      209: '逆变器关机时间',
      210: 'MPPT1直流累计发电量',
      211: 'MPPT2直流累计发电量',
      212: 'MPPT3直流累计发电量',
      213: 'MPPT4直流累计发电量',
      217: '工作模式',
      218: '电池运行状态',
      219: '最大充电功率',
      220: '最大放电功率',
      221: '充放电功率',
      222: '母线电压',
      223: '电池剩余容量',
      224: '电池健康度',
      225: '充放电模式',
      226: '电表状态',
      227: '电网电压',
      228: '电网电流',
      229: '有功功率',
      230: '无功功率',
      231: '功率因数',
      232: '电网频率',
      233: '有功电量(正向有功电度)',
      234: '反向有功电度',
      235: '充电电量',
      236: '放电电量',
      237: '输出功率',
      238: '对地电压',
      239: '故障告警',
      240: '输出电压',
      241: '输出电流',
      242: '输入电压',
      243: '输入电流',
      244: '温度',
      245: '运行状态',
      246: '累计发电量',
      260: '产品型号编码',
      261: '产品序列号',
      262: '内核软件版本号',
      263: '监控软件版本号',
      264: 'FPGA/CPLD软件版本号',
      265: '硬件版本号',
      266: '预留版本号',
      270: 'PV15输入电压',
      271: 'PV16输入电压',
      272: 'PV17输入电压',
      273: 'PV18输入电压',
      274: 'PV19输入电压',
      275: 'PV20输入电压',
      276: 'PV21输入电压',
      277: 'PV22输入电压',
      278: 'PV23输入电压',
      279: 'PV24输入电压',
      280: 'PV15输入电流',
      281: 'PV16输入电流',
      282: 'PV17输入电流',
      283: 'PV18输入电流',
      284: 'PV19输入电流',
      285: 'PV20输入电流',
      286: 'PV21输入电流',
      287: 'PV22输入电流',
      288: 'PV23输入电流',
      289: 'PV24输入电流',
      290: '第11路电流值',
      291: '第12路电流值',
      292: '第13路电流值',
      293: '第14路电流值',
      294: '第15路电流值',
      295: '第16路电流值',
      296: '第17路电流值',
      297: '第18路电流值',
      298: '第19路电流值',
      299: '第20路电流值',
      300: '第21路电流值',
      301: '第22路电流值',
      302: '第23路电流值',
      303: '第24路电流值',
      304: '第21路电流值',
      305: '第22路电流值',
      306: '第23路电流值',
      307: '第24路电流值'
    },
    // 电站参数的信息
    stationParam: {
      DISPERTHRESH: '离散率阈值',
      PVPOWERTHRESH: '组串功率偏低标准',
      LIMITTHRESH: '电站限电阈值',
      INVPPRTOP: '生产偏差阈值',
      DCCOMBINERBASEV: '直流汇流箱组串基准电压',
      REVIEWPERIOD: '巡检周期',
      PRBASELINE: 'PR上限',
      SAFEOPRDATE: '安全运行起始时间',
      branchPowerThresh: '组串支路功率偏低阈值',
      combinerDcDefaultVoltage: '直流汇流箱组串电压'
    }
  }
}
